Австралия/src/Catalogs/AccessGroups/AccessGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AccessGroups</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Administrators</name>
      <description>Administrators</description>
    </items>
  </predefined>
  <attributes>
    <name>Profile</name>
    <type>
      <types>CatalogRef.AccessGroupProfiles</types>
    </type>
  </attributes>
  <attributes>
    <name>UsersType</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>User</name>
    <comment>Only for personal access groups</comment>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>EmployeeResponsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>MainSuppliedProfileAccessGroup</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Users</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.ExternalUsers</types>
        <types>CatalogRef.ExternalUsersGroups</types>
        <types>CatalogRef.UserGroups</types>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccessKinds</name>
    <attributes>
      <name>AccessKind</name>
      <comment>Represented by an empty reference of the main value type</comment>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>AllAllowed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccessValues</name>
    <attributes>
      <name>AccessKind</name>
      <comment>Represented by an empty reference of the main value type</comment>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>AccessValue</name>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/InformationRegisters/RolesRights/RolesRights.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>RolesRights</name>
  <resources>
    <name>Update</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Insert</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ReadWithoutRestriction</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UpdateWithoutRestriction</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InsertWithoutRestriction</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>View</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Edit</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InteractiveInsert</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>MetadataObject</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Role</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/AccessGroupsTables/AccessGroupsTables.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AccessGroupsTables</name>
  <resources>
    <name>Update</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Insert</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ReadWithoutRestriction</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UpdateWithoutRestriction</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InsertWithoutRestriction</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>TableType</name>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>Table</name>
    <type>
      <types>CatalogRef.ExtensionObjectIDs</types>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AccessGroup</name>
    <type>
      <types>CatalogRef.AccessGroups</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Catalogs/AccessGroupProfiles/AccessGroupProfiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AccessGroupProfiles</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Administrator</name>
      <description>Administrator</description>
    </items>
  </predefined>
  <attributes>
    <name>SuppliedDataID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>SuppliedProfileChanged</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Roles</name>
    <attributes>
      <name>Role</name>
      <type>
        <types>CatalogRef.ExtensionObjectIDs</types>
        <types>CatalogRef.MetadataObjectIDs</types>
      </type>
    </attributes>
    <attributes>
      <name>DeleteRole</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccessKinds</name>
    <attributes>
      <name>AccessKind</name>
      <comment>Represented by an empty reference of the main value type</comment>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>PresetAccessKind</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>AllAllowed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AccessValues</name>
    <attributes>
      <name>AccessKind</name>
      <comment>Represented by an empty reference of the main value type</comment>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
    <attributes>
      <name>AccessValue</name>
      <type>
        <types>DefinedType.AccessValue</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Purpose</name>
    <attributes>
      <name>UsersType</name>
      <type>
        <types>DefinedType.User</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <attributes>
    <name>Invalid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>DefinedType.Department</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>DefinedType.Individual</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Internal</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Prepared</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IBUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>IBUserProperies</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldsValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/ExternalUsers/ExternalUsers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ExternalUsers</name>
  <attributes>
    <name>Invalid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AuthorizationObject</name>
    <type>
      <types>DefinedType.ExternalUser</types>
    </type>
  </attributes>
  <attributes>
    <name>SetRolesDirectly</name>
    <comment>It is used if the &quot;Access management&quot; subsystem is not deployed.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Prepared</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IBUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>IBUserProperies</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>DeletePassword</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/AccessGroups/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Variables

Var PreviousValues; // Values of some attributes and tabular sections of the access group before it is changed for use 
                      // in the OnWrite event handler.

#EndRegion

#Region EventHandlers

Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If IsFolder Then
		Return;
	EndIf;
	
	StandardSubsystemsServer.CheckApplicationVersionDynamicUpdate();
	InformationRegisters.RolesRights.CheckRegisterData();
	
	PreviousValues = Common.ObjectAttributesValues(Ref,
		"Ref, Profile, DeletionMark, Users, AccessKinds, AccessValues");
	
	// Deleting blank members of the access group.
	Index = Users.Count() - 1;
	While Index >= 0 Do
		If Not ValueIsFilled(Users[Index].User) Then
			Users.Delete(Index);
		EndIf;
		Index = Index - 1;
	EndDo;
	
	If Ref = Catalogs.AccessGroups.Administrators Then
		
		// Administrator predefined profile is always used.
		Profile = Catalogs.AccessGroupProfiles.Administrator;
		
		// Cannot be a personal access group.
		User = Undefined;
		
		// Regular employees cannot be responsible for the group (only full access users can).
		EmployeeResponsible = Undefined;
		
		// Only full access users are allowed to make changes.
		If NOT PrivilegedMode()
		   AND NOT AccessManagement.HasRole("FullRights") Then
			
			Raise
				NStr("ru = 'Предопределенную группу доступа Администраторы
				           |можно изменять, либо в привилегированном режиме,
				           |либо при наличии роли ""Полные права"".'; 
				           |en = 'The predefined access group Administrators
				           |can be changed only if you have the ""Full access"" role
				           |or in the privileged mode.'; 
				           |pl = 'Nie można zapisać grupy Administratorzy,
				           |ponieważ nie masz wystarczających uprawnień, aby ją edytować.
				           | Skontaktuj się z administratorem, aby uzyskać szczegółowe informacje.';
				           |es_ES = 'El grupo de acceso predeterminado Administradores
				           |se puede cambiar en el modo privilegiado
				           |o si hay rol ""Derechos completos"".';
				           |es_CO = 'El grupo de acceso predeterminado Administradores
				           |se puede cambiar en el modo privilegiado
				           |o si hay rol ""Derechos completos"".';
				           |tr = 'Önceden belirlenmiş Yönetici grubu, 
				           |ya ayrıcalıklı modda 
				           |ya da ""Tüm haklar"" rolü bulunduğunda değiştirilebilir.';
				           |it = 'Il gruppo di accesso predefinito Amministratori
				           |è modificabile solamente in modalità privilegiata
				           |oppure se si dispone del ruolo ""Diritti completi"".';
				           |de = 'Die vordefinierte Zugriffsgruppe Administratoren
				           |kann entweder im privilegierten Modus
				           |oder mit der Rolle ""Volle Zugriffsrechte"" geändert werden.'");
		EndIf;
		
		// Checking whether the access group contains regular users only.
		For each CurrentRow In Users Do
			If TypeOf(CurrentRow.User) <> Type("CatalogRef.Users") Then
				Raise
					NStr("ru = 'Предопределенная группа доступа Администраторы
					           |может содержать только пользователей.
					           |
					           |Группы пользователей, внешние пользователи и
					           |группы внешних пользователей недопустимы.'; 
					           |en = 'Predefined access group Administrators
					           |can contain only users.
					           |
					           |User groups, external users, and
					           |external user groups are not allowed.'; 
					           |pl = 'Nie można zapisać grupy Administratorzy, ponieważ zawiera ona 
					           | jedną lub kilka pozycji następujących typów: grupę użytkowników, użytkownika zewnętrznego
					           |lub zewnętrzną grupę użytkowników.
					           |
					           |Usuń te elementy i spróbuj ponownie.';
					           |es_ES = 'No se puede guardar el grupo de Administradores porque el grupo contiene
					           |uno o varios artículos de los siguientes tipos: grupo de usuarios, usuario externo,
					           |o el grupo de usuarios externos.
					           |
					           |Eliminar estos artículos y probar de nuevo.';
					           |es_CO = 'No se puede guardar el grupo de Administradores porque el grupo contiene
					           |uno o varios artículos de los siguientes tipos: grupo de usuarios, usuario externo,
					           |o el grupo de usuarios externos.
					           |
					           |Eliminar estos artículos y probar de nuevo.';
					           |tr = 'Yöneticiler grubu, aşağıdaki türlerden 
					           |bir veya birkaç öğe içerdiği için kaydedilemez: kullanıcı grubu, harici kullanıcı veya 
					           |harici kullanıcı grubu.
					           |
					           |Bu öğeleri kaldırın ve tekrar deneyin.';
					           |it = 'Il gruppo di accesso predefinito Amministratori
					           |può contenere solo utenti.
					           |
					           |Non sono permessi gruppi utenti, utenti esterni e gruppi
					           |utenti esterni.';
					           |de = 'Die Gruppe Administratoren kann nicht gespeichert werden, da sie
					           |ein oder mehrere Elemente der folgenden Typen enthält: Benutzergruppe, externer Benutzer oder
					           |externe Benutzergruppe.
					           |
					           |Entfernen Sie diese Elemente und versuchen Sie es erneut.'");
			EndIf;
		EndDo;
		
	// Administrator predefined profile cannot be set to an arbitrary access group.
	ElsIf Profile = Catalogs.AccessGroupProfiles.Administrator Then
		Raise
			NStr("ru = 'Предопределенный профиль Администратор может быть только
			           |у предопределенной группы доступа Администраторы.'; 
			           |en = 'Only predefined access group ""Administrators""
			           |can have predefined profile ""Administrator.""'; 
			           |pl = 'Predefiniowany profil Administrator może należeć tylko
			           |do predefiniowanej grupy dostępu Administratorzy.';
			           |es_ES = 'El perfil predeterminado Administrador lo puede tener solo
			           |el grupo de acceso predeterminado Administradores.';
			           |es_CO = 'El perfil predeterminado Administrador lo puede tener solo
			           |el grupo de acceso predeterminado Administradores.';
			           |tr = 'Önceden tanımlanmış Yönetici profili 
			           |yalnızca önceden tanımlanmış Yöneticiler erişim grubunda olabilir.';
			           |it = 'Il profilo predefinito Amministratore può essere assegnato solamente
			           |al gruppo di accesso predefinito Amministratori.';
			           |de = 'Ein vordefiniertes Administrator-Profil kann nur
			           |von einer vordefinierten Administratoren-Zugriffsgruppe angelegt werden.'");
	EndIf;
	
	If Not IsFolder Then
		
		// Automatically setting attributes for the personal access group.
		If ValueIsFilled(User) Then
			Parent = Catalogs.AccessGroups.PersonalAccessGroupsParent();
		Else
			User = Undefined;
			If Parent = Catalogs.AccessGroups.PersonalAccessGroupsParent(True) Then
				Parent = Undefined;
			EndIf;
		EndIf;
		
		// Upon clearing a deletion mark from an access group, the deletion mark is also cleared from its 
		// profile.
		If Not DeletionMark AND PreviousValues.DeletionMark = True Then
			ProfileDeletionMark = Common.ObjectAttributeValue(Profile, "DeletionMark");
			ProfileDeletionMark = ?(ProfileDeletionMark = Undefined, False, ProfileDeletionMark);
			If ProfileDeletionMark Then
				LockDataForEdit(Profile);
				ProfileObject = Profile.GetObject();
				ProfileObject.DeletionMark = False;
				ProfileObject.Write();
			EndIf;
		EndIf;
	EndIf;
	
EndProcedure

// Updates:
// - roles of added, remaining, and deleted users
// - InformationRegister.AccessGroupsTables
// - InformationRegister.AccessGroupsValues
//
Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If IsFolder Then
		Return;
	EndIf;
	
	If Not AdditionalProperties.Property("DoNotUpdateUsersRoles") Then
		UpdateUsersRolesOnChangeAccessGroup();
	EndIf;
	
	HasMembers = Users.Count() <> 0;
	HasOldMembers = PreviousValues.Ref = Ref AND Not PreviousValues.Users.IsEmpty();
	
	If Profile           <> PreviousValues.Profile
	 Or DeletionMark   <> PreviousValues.DeletionMark
	 Or HasMembers <> HasOldMembers Then
		
		InformationRegisters.AccessGroupsTables.UpdateRegisterData(Ref);
	EndIf;
	
	If Catalogs.AccessGroups.AccessKindsOrAccessValuesChanged(PreviousValues, ThisObject)
	 Or DeletionMark   <> PreviousValues.DeletionMark
	 Or HasMembers <> HasOldMembers Then
		
		InformationRegisters.AccessGroupsValues.UpdateRegisterData(Ref);
	EndIf;
	
	Catalogs.AccessGroupProfiles.UpdateAuxiliaryProfilesDataChangedOnImport();
	Catalogs.AccessGroups.UpdateAccessGroupsAuxiliaryDataChangedOnImport();
	Catalogs.AccessGroups.UpdateAuxiliaryDataOfUserGroupsChangedOnImport();
	Catalogs.AccessGroups.UpdateUsersRolesChangedOnImport();
	
	If AccessManagementInternal.LimitAccessAtRecordLevelUniversally() Then
		ChangedMembersTypes = ChangedMembersTypes(Users, PreviousValues.Users);
		AccessManagementInternal.ScheduleAccessGroupsSetsUpdate(
			ChangedMembersTypes.Users, ChangedMembersTypes.ExternalUsers);
		
		If Not DeletionMark Then
			AccessManagementInternal.ScheduleAccessUpdateOnChangeAccessGroupMembers(Ref,
				ChangedMembersTypes);
		EndIf;
		If DeletionMark <> PreviousValues.DeletionMark Then
			AccessManagementInternal.UpdateAccessGroupsOfAllowedAccessKey(Ref);
		EndIf;
	EndIf;
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If AdditionalProperties.Property("VerifiedObjectAttributes") Then
		Common.DeleteNotCheckedAttributesFromArray(
			CheckedAttributes, AdditionalProperties.VerifiedObjectAttributes);
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

Function ChangedMembersTypes(NewMembers, OldMembers)
	
	ChangedMembersTypes = New Structure;
	ChangedMembersTypes.Insert("Users", False);
	ChangedMembersTypes.Insert("ExternalUsers", False);
	
	AllMembers = NewMembers.Unload(, "User");
	AllMembers.Columns.Add("RowChangeKind", New TypeDescription("Number"));
	AllMembers.FillValues(1, "RowChangeKind");
	If OldMembers <> Undefined Then
		Selection = OldMembers.Select();
		While Selection.Next() Do
			NewRow = AllMembers.Add();
			NewRow.User = Selection.User;
			NewRow.RowChangeKind = -1;
		EndDo;
	EndIf;
	AllMembers.GroupBy("User", "RowChangeKind");
	For Each Row In AllMembers Do
		If Row.RowChangeKind = 0 Then
			Continue;
		EndIf;
		If TypeOf(Row.User) = Type("CatalogRef.Users")
		 Or TypeOf(Row.User) = Type("CatalogRef.UserGroups") Then
			ChangedMembersTypes.Users = True;
		EndIf;
		If TypeOf(Row.User) = Type("CatalogRef.ExternalUsers")
		 Or TypeOf(Row.User) = Type("CatalogRef.ExternalUsersGroups") Then
			ChangedMembersTypes.ExternalUsers = True;
		EndIf;
	EndDo;
	
	Return ChangedMembersTypes;
	
EndFunction

Procedure UpdateUsersRolesOnChangeAccessGroup()
	
	If Common.SubsystemExists("StandardSubsystems.SaaS") Then
		ModuleSaaS = Common.CommonModule("SaaS");
		SessionWithoutSeparators = ModuleSaaS.SessionWithoutSeparators();
	Else
		SessionWithoutSeparators = True;
	EndIf;
	
	If Common.DataSeparationEnabled()
		AND Ref = Catalogs.AccessGroups.Administrators
		AND Not SessionWithoutSeparators
		AND AdditionalProperties.Property("ServiceUserPassword") Then
		
		ServiceUserPassword = AdditionalProperties.ServiceUserPassword;
	Else
		ServiceUserPassword = Undefined;
	EndIf;
	
	SetPrivilegedMode(True);
	
	UsersForUpdate =
		Catalogs.AccessGroups.UsersForRolesUpdate(PreviousValues, ThisObject);
	
	If Ref = Catalogs.AccessGroups.Administrators Then
		// Adding users associated with infobase users with the FullAccess role.
		
		For Each InfobaseUser In InfoBaseUsers.GetUsers() Do
			If InfobaseUser.Roles.Contains(Metadata.Roles.FullRights) Then
				
				FoundUser = Catalogs.Users.FindByAttribute(
					"IBUserID", InfobaseUser.UUID);
				
				If NOT ValueIsFilled(FoundUser) Then
					FoundUser = Catalogs.ExternalUsers.FindByAttribute(
						"IBUserID", InfobaseUser.UUID);
				EndIf;
				
				If ValueIsFilled(FoundUser)
				   AND UsersForUpdate.Find(FoundUser) = Undefined Then
					
					UsersForUpdate.Add(FoundUser);
				EndIf;
				
			EndIf;
		EndDo;
	EndIf;
	
	AccessManagement.UpdateUserRoles(UsersForUpdate, ServiceUserPassword);
	
EndProcedure

#EndRegion

#EndIf
